# IFCFileModelOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileModelOptions Constructor
IFCFileModelOptions Class See Also
---
Creates a default IFCFileModelOptions. The default schema file is empty and cache size is 8192.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCFileModelOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCFileModelOptions()
```

# See Also
IFCFileModelOptions Class
Autodesk.Revit.DB.IFC Namespace